In [ ]:
import sqlite3

Creating "Assignment" database and seeting up connection and cursor

In [ ]:
DBPATH = 'assignment.db'
conn = sqlite3.connect(DBPATH)
cursor = conn.cursor()

## Question 3: Heroes

Creating Superheroes database

In [ ]:
sql = (
    "CREATE TABLE IF NOT EXISTS Heroes ("
    "id INTEGER PRIMARY KEY AUTOINCREMENT,"
    "name VARCHAR(100) NOT NULL,"
    "gender VARCHAR(100) NULL,"
    "height VARCHAR(100) NULL,"
    "weight VARCHAR(100) NULL,"
    "age INTEGER NOT NULL,"
    "origin_planet VARCHAR(100) NULL,"
    "can_fly BOOLEAN DEFAULT(FALSE)"
    ")"
)

cursor.execute(sql)
conn.commit()

#### 3A: a. Write a SQL statement to add Superman to the heroes table and be sure to provide values for all columns.

In [ ]:
sql = """INSERT INTO Heroes (id, name, gender, height, weight, age, origin_planet, can_fly) 
VALUES (?,?,?,?,?,?,?,?)"""
cursor.execute(sql, (999, "Superman", "male", "6 ft 1 in", "180 lbs", 35, "Krypton", True))

Check that the intsert for Superman's info worked

In [ ]:
cursor.execute("SELECT * FROM Heroes WHERE name=?", ("Superman",))
print(cursor.fetchone())

#### 3B. Write a SQL statement to update Superman's age to 36.

In [ ]:
cursor.execute("UPDATE Heroes SET age='36' WHERE name='Superman'")

Check to make sure age updated for Superman entry

In [ ]:
cursor.execute("SELECT * FROM Heroes WHERE name=?", ("Superman",))
print(cursor.fetchone())

#### 3C. Write a SQL statement to remove Superman from the table using his row id.

In [ ]:
cursor.execute("DELETE FROM Heroes WHERE id=999")

Check to make sure Superman entry was deleted

In [ ]:
cursor.execute("SELECT * FROM Heroes WHERE name=?", ("Superman",))
print(cursor.fetchone())

#### 3D. Write a SQL statement to remove all heroes from Mars.

In [ ]:
cursor.execute("DELETE FROM Heroes WHERE origin_planet='Mars'")

#### 3E. Write a SQL statement that returns only the name and gender of all heroes.

In [ ]:
cursor.execute("SELECT name, gender FROM Heroes")

#### 3F. Write a SQL statement that returns all heroes (all fields) sorted by age in descending order.

In [ ]:
cursor.execute("SELECT * FROM Heroes ORDER BY age DESC")

#### 3G. Write a SQL statement that returns the name of all heroes that cannot fly.

In [ ]:
cursor.execute("SELECT name FROM Heroes WHERE can_fly IS FALSE")

#### 3H. Write a SQL statement that returns the name of all heroes from Earth or Krypton sorted by planet.

In [ ]:
cursor.execute("SELECT name FROM Heroes WHERE origin_planet IN('Earth','Krypton') ORDER BY origin_planet")

## Question 4: Joins

Creating Employee table

In [ ]:
sql = (
    "CREATE TABLE IF NOT EXISTS Employee ("
    "id INTEGER PRIMARY KEY AUTOINCREMENT,"
    "first_name VARCHAR(100) NOT NULL,"
    "last_name VARCHAR(100) NOT NULL,"
    "gender VARCHAR(100) NULL,"
    "salary INTEGER NOT NULL,"
    "location_id INTEGER NOT NULL,"
    "department_id INTEGER NOT NULL"
    ")"
)

cursor.execute(sql)
conn.commit()

Creating Department table

In [ ]:
sql = (
    "CREATE TABLE IF NOT EXISTS Department ("
    "id INTEGER PRIMARY KEY AUTOINCREMENT,"
    "name varchar(50) NOT NULL"
    ")"
)

cursor.execute(sql)
conn.commit()

Creating Location table

In [ ]:
sql = (
    "CREATE TABLE IF NOT EXISTS Location ("
    "id INTEGER PRIMARY KEY AUTOINCREMENT,"
    "city varchar(50) NOT NULL,"
    "state varchar(50) NOT NULL"
    ")"
)

cursor.execute(sql)
conn.commit()

#### 4A. List all of the Information Technology employees in the Baltimore location sorted by last name and then first name.  Do not use the 'id' to filter but rather join the employee and location tables and then filter with the where clause using the string 'Baltimore'.

In [ ]:
sql = ("""SELECT * FROM Employee e
LEFT JOIN Department d
ON e.department_id = d.id
LEFT JOIN Location l
ON e.location_id = l.id
WHERE UPPER(d.name) = 'INFORMATION TECHNOLOGY'
AND UPPER(l.city) = 'BALTIMORE'
ORDER BY e.last_name, e.first_name""")

cursor.execute(sql)
print(cursor.fetchone())

#### 4B. Count all of the employees in the Arlington location.  Do not use the 'id' to filter but rather join the employee and location tables and then filter with the where or having clause using the string 'Arlington'.

In [ ]:
sql = ("""SELECT COUNT(*) FROM Employee e
LEFT JOIN Location l
ON e.location_id = l.id
WHERE UPPER(l.city) = 'ARLINGTON'""")

cursor.execute(sql)
print(cursor.fetchone())

#### 4C. Join the employee and location tables and compute the average salary for all employees by location using a GROUP BY clause.

In [ ]:
sql = ("""SELECT l.city, AVG(e.salary) FROM Employee e
LEFT JOIN Location l
ON e.location_id = l.id
GROUP BY l.id""")

cursor.execute(sql)
print(cursor.fetchone())

#### 4D. Join all three tables together and compute the average salary for sales employees in VA using a GROUP BY clause.

In [ ]:
sql = ("""SELECT AVG(e.salary) FROM Employee e
LEFT JOIN Department d
ON e.department_id = d.id
LEFT JOIN Location l
ON e.location_id = l.id
WHERE UPPER(d.name) = 'SALES'
AND UPPER(l.state) = 'VA'
GROUP BY d.name, l.state""")

cursor.execute(sql)
print(cursor.fetchone())